; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 123581 2 3 3 4 5
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	image1 - mode
	thermograph0 - mode
	spectrograph2 - mode
	GroundStation1 - direction
	Star0 - direction
	GroundStation3 - direction
	GroundStation2 - direction
	Planet4 - direction
	Star5 - direction
	Planet6 - direction
	Star7 - direction
	Phenomenon8 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 thermograph0)
	(supports instrument1 image1)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet6)
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 Star0)
	(supports instrument3 image1)
	(supports instrument3 spectrograph2)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 GroundStation3)
	(supports instrument4 spectrograph2)
	(supports instrument4 thermograph0)
	(supports instrument4 image1)
	(calibration_target instrument4 GroundStation2)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon8)
)
(:goal (and
	(pointing satellite1 Planet4)
	(have_image Planet4 spectrograph2)
	(have_image Star5 thermograph0)
	(have_image Planet6 image1)
	(have_image Star7 spectrograph2)
	(have_image Phenomenon8 spectrograph2)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 6
2. (turn_to satellite1 planet4 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 planet4)
   goals met: 1 of 6
3. (turn_to satellite0 groundstation2 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 groundstation2)
   goals met: 1 of 6
4. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 1 of 6
5. (calibrate satellite0 instrument1 groundstation2)
   added: (calibrated instrument1)
   goals met: 1 of 6
6. (turn_to satellite1 groundstation2 planet4)
   deleted: (pointing satellite1 planet4)
   added: (pointing satellite1 groundstation2)
   goals met: 0 of 6
7. (turn_to satellite0 star7 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 star7)
   goals met: 0 of 6
8. (calibrate satellite1 instrument4 groundstation2)
   added: (calibrated instrument4)
   goals met: 0 of 6
9. (take_image satellite0 star7 instrument1 spectrograph2)
   added: (have_image star7 spectrograph2)
   goals met: 1 of 6
10. (turn_to satellite1 planet4 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 planet4)
   goals met: 2 of 6
11. (turn_to satellite0 star5 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star5)
   goals met: 2 of 6
12. (take_image satellite1 planet4 instrument4 spectrograph2)
   added: (have_image planet4 spectrograph2)
   goals met: 3 of 6
13. (take_image satellite0 star5 instrument1 thermograph0)
   added: (have_image star5 thermograph0)
   goals met: 4 of 6
14. (turn_to satellite1 planet6 planet4)
   deleted: (pointing satellite1 planet4)
   added: (pointing satellite1 planet6)
   goals met: 3 of 6
15. (turn_to satellite0 phenomenon8 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 phenomenon8)
   goals met: 3 of 6
16. (take_image satellite1 planet6 instrument4 image1)
   added: (have_image planet6 image1)
   goals met: 4 of 6
17. (turn_to satellite1 planet4 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 planet4)
   goals met: 5 of 6
18. (take_image satellite0 phenomenon8 instrument1 spectrograph2)
   added: (have_image phenomenon8 spectrograph2)
   goals met: 6 of 6
